cask_args appdir: "/Applications"

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'asdf'                          # Manage multiple runtime versions (https://github.com/asdf-vm/asdf)
brew 'bat'                           # Better `cat` (https://github.com/sharkdp/bat)
brew 'diff-so-fancy'                 # Readable diffs (https://github.com/so-fancy/diff-so-fancy)
brew 'direnv'                        # Project-based env variables (https://github.com/direnv/direnv)
brew 'dockutil'                      # Manage dock items (https://github.com/kcrawford/dockutil)
brew 'exa'                           # Better `ls` (https://github.com/ogham/exa)
brew 'fd'                            # Better `find` (https://github.com/sharkdp/fd)
brew 'fish'                          # More friendly shell (https://fishshell.com)
brew 'fnm'                           # Fast Node.js version manager (https://github.com/Schniz/fnm)
brew 'fzf'                           # Fuzzy finder (https://github.com/junegunn/fzf)
brew 'gh'                            # GitHub CLI (https://cli.github.com)
brew 'git'
brew 'gpg'
brew 'httpie'                        # HTTP CLI (https://github.com/httpie/httpie)
brew 'jq'                            # JSON CLI (https://github.com/stedolan/jq)
brew 'mas'                           # App Store CLI (https://github.com/mas-cli/mas)
brew 'nvim'                          # Better `vim` (https://github.com/neovim/neovim)
brew 'ripgrep'                       # Better `grep` (https://github.com/BurntSushi/ripgrep)

cask 'bartender'                     # Clean up menu bar (https://macbartender.com)
cask 'cleanshot'                     # Better screenshots (https://cleanshot.com)
cask 'contexts'                      # Better `cmd + tab` (https://contexts.co)
cask 'cron'                          # Better Calendar.app (https://cron.app)
cask 'daisydisk'                     # Better disk utility (https://daisydiskapp.com)
cask 'dropbox'                       # File storage (https://dropbox.com)
cask 'figma-beta'                    # Design tool (https://figma.com)
cask 'firefox'                       # Browser (https://firefox.com)
cask 'flux'                          # Stop blue light (https://justgetflux.com)
cask 'font-jetbrains-mono-nerd-font' # Programming font (https://github.com/JetBrains/JetBrainsMono)
cask 'keybase'                       # Store keys (https://keybase.io)
cask 'monitorcontrol'                # Control external monitor (https://github.com/MonitorControl/MonitorControl)
cask 'numi'                          # Programmable calculator (https://github.com/nikolaeu/numi)
cask 'pixelsnap'                     # Measure anything on screen (https://getpixelsnap.com)
cask 'postgres'                      # Fastest PostgreSQL setup (https://postgresapp.com)
cask 'postico'                       # Moder PostgreSQL client (https://eggerapps.at/postico)
cask 'raycast'                       # Better Spotlight (https://raycast.com)
cask 'sip'                           # Color picker (https://sipapp.io)
cask 'tuple'                         # Screen sharing (https://tuple.app)
cask 'wezterm-nightly'               # Better Terminal.app (https://wezfurlong.org/wezterm)

mas '1Password',  id: 1333542190
mas 'Craft',      id: 1487937127
mas 'Dato',       id: 1470584107
mas 'Day One',    id: 1055511498
mas 'Pure Paste', id: 1611378436
mas 'Velja',      id: 1607635845
mas 'Xcode',      id: 497799835
# vim:syntax=ruby
