cask_args appdir: "/Applications"

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

brew 'bat'                           # Better `cat` (https://github.com/sharkdp/bat)
brew 'diff-so-fancy'                 # Readable diffs (https://github.com/so-fancy/diff-so-fancy)
brew 'direnv'                        # Project-based env variables (https://github.com/direnv/direnv)
brew 'exa'                           # Better `ls` (https://github.com/ogham/exa)
brew 'fd'                            # Better `find` (https://github.com/sharkdp/fd)
brew 'fish'                          # More friendly shell (https://fishshell.com)
brew 'fnm'                           # Fast Node.js version manager (https://github.com/Schniz/fnm)
brew 'fzf'                           # Fuzzy finder (https://github.com/junegunn/fzf)
brew 'gh'                            # GitHub CLI (https://cli.github.com)
brew 'git'
brew 'gpg'
brew 'jq'                            # JSON CLI (https://github.com/stedolan/jq)
brew 'mas'                           # App Store CLI (https://github.com/mas-cli/mas)
brew 'nvim'                          # Better `vim` (https://github.com/neovim/neovim)
brew 'ripgrep'                       # Better `grep` (https://github.com/BurntSushi/ripgrep)
brew 'tmux'                       

cask '1password'                     # Password manager (https://1password.com)
cask '1password-cli'
cask 'bartender'                     # Clean up menu bar (https://macbartender.com)
cask 'betterdisplay'                 # Control external monitor (https://github.com/waydabber/BetterDisplay)
cask 'cleanshot'                     # Better screenshots (https://cleanshot.com)
cask 'contexts'                      # Better `cmd + tab` (https://contexts.co)
cask 'cron'                          # Better Calendar.app (https://cron.app)
cask 'daisydisk'                     # Better disk utility (https://daisydiskapp.com)
cask 'dropbox'                       # File storage (https://dropbox.com)
cask 'figma'                         # Design tool (https://figma.com)
cask 'firefox'                       # Browser (https://firefox.com)
cask 'flux'                          # Stop blue light (https://justgetflux.com)
cask 'font-jetbrains-mono-nerd-font' # Programming font (https://github.com/JetBrains/JetBrainsMono)
cask 'google-chrome'
cask 'iterm2'                        # Better Terminal.app (https://iterm2.com)
cask 'numi'                          # Programmable calculator (https://github.com/nikolaeu/numi)
cask 'pixelsnap'                     # Measure anything on screen (https://getpixelsnap.com)
cask 'raycast'                       # Better Spotlight (https://raycast.com)
cask 'sf-symbols'
cask 'sip'                           # Color picker (https://sipapp.io)
cask 'tuple'                         # Screen sharing (https://tuple.app)

mas 'BetterSnapTool', id: 417375580
mas 'Craft',          id: 1487937127
mas 'Dato',           id: 1470584107
mas 'Pure Paste',     id: 1611378436
mas 'Velja',          id: 1607635845
mas 'Xcode',          id: 497799835

# Install from GitHub Releases (https://github.com/kcrawford/dockutil/releases)
# https://github.com/kcrawford/dockutil/issues/146
# brew 'dockutil'                    # Manage dock items (https://github.com/kcrawford/dockutil)
