cask_args appdir: "/Applications"

tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'asdf'                  # Version manager (https://github.com/asdf-vm/asdf)
brew 'bat'                   # Better `cat` (https://github.com/sharkdp/bat)
brew 'diff-so-fancy'         # Readable diffs (https://github.com/so-fancy/diff-so-fancy)
brew 'direnv'                # Project-based env variables (https://github.com/direnv/direnv)
brew 'docker'
brew 'dockutil'              # Manage dock items (https://github.com/kcrawford/dockutil)
brew 'exa'                   # Better `ls` (https://github.com/ogham/exa)
brew 'fd'                    # Better `find` (https://github.com/sharkdp/fd)
brew 'fish'                  # More friendly shell (https://fishshell.com)
brew 'fzf'                   # Fuzzy finder (https://github.com/junegunn/fzf)
brew 'gh'                    # GitHub CLI (https://cli.github.com)
brew 'git'
brew 'gpg'
brew 'httpie'                # HTTP CLI (https://github.com/httpie/httpie)
brew 'jq'                    # JSON CLI (https://github.com/stedolan/jq)
brew 'mas'                   # App Store CLI (https://github.com/mas-cli/mas)
brew 'nvim'                  # Better `vim` (https://github.com/neovim/neovim)
brew 'ripgrep'               # Better `grep` (https://github.com/BurntSushi/ripgrep)
brew 'tmux'                  # Terminal multiplexer (https://github.com/tmux/tmux)

cask 'bartender'             # Clean up menu bar (https://www.macbartender.com)
cask 'caffeine'              # Prevent sleep (https://intelliscapesolutions.com/apps/caffeine)
cask 'choosy'                # Choose where links open (https://www.choosyosx.com)
cask 'cleanshot'             # Better screenshots (https://cleanshot.com)
cask 'contexts'              # Better `cmd + tab` (https://contexts.co)
cask 'daisydisk'             # Better disk utility (https://daisydiskapp.com)
cask 'dash'                  # Doc browser (https://kapeli.com/dash)
cask 'dropbox'
cask 'discord'
cask 'figma-beta'
cask 'firefox'
cask 'flux'                  # Stop blue light (https://justgetflux.com)
cask 'font-jetbrains-mono'   # Programming font (https://github.com/JetBrains/JetBrainsMono)
cask 'google-chrome'
cask 'hey'                   # Email with custom domains (https://www.hey.com)
cask 'hyperdock'             # Window manager (https://bahoom.com/hyperdock)
cask 'iterm2'                # Better Terminal.app (https://iterm2.com)
cask 'keybase'
cask 'monitorcontrol'        # Control external monitor (https://github.com/MonitorControl/MonitorControl)
cask 'mumu'                  # Better emoji picker (https://getmumu.com)
cask 'numi'                  # Programmable calculator (https://github.com/nikolaeu/numi)
cask 'pixelsnap'             # Measure anything on screen (https://getpixelsnap.com)
cask 'postgres'              # Fastest PostgreSQL setup (https://postgresapp.com)
cask 'postico'               # Moder PostgreSQL client (https://eggerapps.at/postico)
cask 'raycast'               # Better Spotlight (https://raycast.com)
cask 'sip'                   # Color picker (https://sipapp.io)

mas '1Password', id: 1333542190
mas 'Craft',     id: 1487937127
mas 'Dato',      id: 1470584107
mas 'OpenIn',    id: 1547147101
mas 'Xcode',     id: 497799835
# vim:syntax=ruby
